In [2]:
import matplotlib.pyplot as plt

print("hello world")

hello world

In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
data = sns.load_dataset('tips')

In [5]:
df = pd.read_csv("tips_data.csv", index_col = 0)

In [6]:
df.to_csv("temp/tips_data.csv", index = False)

In [18]:
df = pd.DataFrame({
    'A' : [1,2,3],
    'B' : ['a', 'b', 'c']    
}, index = ['idx3', 'idx2', 'idx1'] )
df

      A  B
idx3  1  a
idx2  2  b
idx1  3  c

In [16]:
df.loc['idx2']

A    2
B    b
Name: idx2, dtype: object

In [19]:
df.sort_index()

      A  B
idx1  3  c
idx2  2  b
idx3  1  a

In [20]:
df.set_index('A')

   B
A
1  a
2  b
3  c

In [24]:
df.index = ['r', 's', 'e']
df

   A  B
r  1  a
s  2  b
e  3  c

In [26]:
df.reset_index(drop=True)

   A  B
0  1  a
1  2  b
2  3  c

2-4 컬럼

In [30]:
data = {
    'name' : ['Alice', 'bob', 'Charlie'],
    'age' : [25,30,35],
    'gender' : ['female', 'male', 'male']
}
df = pd.DataFrame(data)
df

      name  age  gender
0    Alice   25  female
1      bob   30    male
2  Charlie   35    male

In [31]:
df['name']

0      Alice
1        bob
2    Charlie
Name: name, dtype: object

In [32]:
df['age']

0    25
1    30
2    35
Name: age, dtype: int64

In [35]:
df.columns = ['이름', '나이', '성별']
df

        이름  나이      성별
0    Alice  25  female
1      bob  30    male
2  Charlie  35    male

In [36]:
df.rename(columns = {'이름' : 'name'})

      name  나이      성별
0    Alice  25  female
1      bob  30    male
2  Charlie  35    male

In [41]:
df['스포츠'] = '축구' 
df

        이름  나이      성별 스포츠
0    Alice  25  female  축구
1      bob  30    male  축구
2  Charlie  35    male  축구

In [42]:
del df['스포츠']
df

        이름  나이      성별
0    Alice  25  female
1      bob  30    male
2  Charlie  35    male